{
    "basics": {
        "name": "Stephen L Boettcher",
        "label": "Technical Project Manager / Senior Business Analyst",
        "image": "/src/images/Me.JPG",
        "email": "boest02@gmail.com",
        "phone": "516-220-4640",
        "portfolio_url": "sboettcher.com",
        "linkedin_url": "linkedin.com/in/stephenboettcher",
        "github_url": "github.com/boest02",
        "res_summary": [
            "Technical Project Manager and Senior Business Analyst with over a decade of experience leading agile teams and delivering high-impact software solutions. Adept at translating complex business workflows and technical requirements into clear, actionable, and testable user stories, ensuring development teams can efficiently implement features that align with business objectives. Proven success in bridging communication between stakeholders, product teams, and engineers to facilitate clarity, alignment, and predictable delivery.",
            "Skilled in driving product strategy and defining functional specifications that support measurable business outcomes, including a 15% improvement in user retention and a 20% increase in organic traffic. Experienced in conducting discovery sessions, analyzing data, and modeling processes to identify opportunities for optimization and operational efficiency. Strong aptitude for balancing technical feasibility with business value, ensuring solutions are scalable, maintainable, and meet user needs.",
            "Brings a solid foundation in programming principles and modern web development practices, enabling effective collaboration with engineering teams and informed decision-making throughout the software development lifecycle. Adept at fostering cross-functional collaboration, mentoring team members, and managing iterative delivery in fast-paced environments while maintaining focus on quality, accessibility, and end-user experience."
        ],
        "home_summary": [],
        "summary": "",
        "location": {
            "city": "Floral Park",
            "countryCode": "US",
            "region": "New York",
            "postalCode": "11001"
        },
        "profiles": [
            {
                "network": "LinkedIn",
                "username": "boest02",
                "url": "https://www.linkedin.com/in/stephen-boettcher-77051b7/",
                "icon": "https://encrypted-tbn0.gstatic.com/images?q=tbn:ANd9GcT7PAYCRc3WD7kGgYDf1ZyIBHCIPLOD4v1wpg&s"
            },
            {
                "network": "GitHub",
                "username": "boest02",
                "url": "https://github.com/boest02",
                "icon": "https://cdn-icons-png.flaticon.com/512/25/25231.png"
            },
            {
                "network": "GitLab",
                "username": "@boest02",
                "url": "https://gitlab.com/boest02",
                "icon": "https://gitlab.com/assets/favicon-72a2cad5025aa931d6ea56c3201d1f18e68a8cd39788c7c80d5b2b82aa5143ef.png"
            },
            {
                "network": "CodePen",
                "username": "boest02",
                "url": "https://codepen.io/boest02",
                "icon": "https://cdn.iconscout.com/icon/free/png-256/free-codepen-icon-download-in-svg-png-gif-file-formats--behance-logo-delicious-social-media-technology-development-pack-user-interface-icons-6700108.png?f=webp&w=256"
            },
            {
                "network": "JSFiddle",
                "username": "boest02",
                "url": "https://jsfiddle.net/u/boest02/fiddles/",
                "icon": "https://pbs.twimg.com/profile_images/1832018871382872064/wxvfa5pU_400x400.jpg"
            }
        ]
    },
    "work": [
        {
            "name": "Freelance / Independent Projects",
            "position": "Technical Project Manager / Business Analyst",
            "url": "",
            "startDate": "2025-04-25",
            "endDate": "",
            "highlights": [
                "Partnered with small clients to define project scope, clarify business objectives, and translate requirements into actionable technical plans for custom web solutions.",
                "Evaluated and selected technologies such as Next.js, React, TypeScript, and Astro based on scalability, performance goals, and client constraints.",
                "Created project timelines, task breakdowns, and milestone plans to ensure predictable delivery and strong alignment with client expectations.",
                "Managed deployment workflows using GitHub CI/CD and Netlify, ensuring reliable releases and seamless client feedback cycles.",
                "Led testing, accessibility reviews, and SEO audits to ensure each site met technical quality standards and business success criteria."
            ],
            "resume": true
        },
        {
            "name": "Publishers Clearing House",
            "position": "Lead Front-End Developer",
            "url": "https://info.pch.com/",
            "startDate": "2019-08-01",
            "endDate": "2025-04-24",
            "highlights": [
                "Collaborated with Product teams to analyze complex business requirements and translate them into user-focused features, contributing to a 20% increase in organic traffic.",
                "Led frontend planning, refinement, and design alignment sessions to ensure all solutions met business objectives, UX standards, and long-term maintainability goals.",
                "Coordinated acceptance testing and iterative feedback loops with QA and stakeholders to validate features and ensure they met critical business needs."
            ],
            "resume": true
        },
        {
            "name": "Publishers Clearing House",
            "position": "Front-End Developer",
            "url": "https://info.pch.com/",
            "startDate": "2018-08-01",
            "endDate": "2019-07-30",
            "highlights": [
                "Built and launched a customizable communication module that enabled targeted user messaging and drove significant improvements in engagement and conversion rates.",
                "Collaborated cross-functionally to design and implement features that supported key business objectives in a fast-paced gaming environment.",
                "Partnered with marketing analysts to implement tracking and analytics, producing insights that informed A/B testing and future campaign strategies."
            ],
            "resume": true
        },
        {
            "name": "Publishers Clearing House",
            "position": "Business Analyst / Scrum Master",
            "url": "https://info.pch.com/",
            "startDate": "2013-11-01",
            "endDate": "2018-07-30",
            "highlights": [
                "Led discovery, requirements gathering, and documentation for major cross-departmental initiatives such as the Contest Tracking System, improving fulfillment workflows and compliance.",
                "Served as Scrum Master for four Agile teams, managing sprint ceremonies, defining goals, tracking velocity, and conducting stakeholder demos to ensure predictable delivery.",
                "Used data analysis to identify engagement drop-offs and influenced feature updates that improved retention by 15%.",
                "Managed integrations with legacy systems and third-party platforms to improve data consistency, system communication, and operational efficiency.",
                "Coordinated delivery with marketing, legal, and engineering teams to execute complex projects under tight deadlines."
            ],
            "resume": true
        },
        {
            "name": "Computer Associates",
            "position": "Director / Senior Manager: ARCserve",
            "url": "https://en.wikipedia.org/wiki/CA_Technologies",
            "startDate": "2003-05-01",
            "endDate": "2013-05-30",
            "highlights": [
                "Directed global software development initiatives within the ARCserve division, guiding projects from design through deployment for enterprise backup and device-integration products.",
                "Led distributed engineering teams across multiple time zones (U.S., Beijing, Hyderabad), optimizing collaboration, productivity, and delivery efficiency.",
                "Developed high-performance Win32 C components and implemented SCSI protocols for tape drives and libraries, improving system stability and data transfer reliability across SAN environments.",
                "Implemented an organization-wide code peer review process, improving code quality, consistency, and cross-team knowledge sharing.",
                "Produced detailed design documents, workflows, and technical specifications to ensure clarity, alignment, and successful delivery of complex projects.",
                "Mentored engineering teams through design and implementation challenges, accelerating defect resolution and promoting architectural best practices.",
                "Delivered technical training and enablement sessions for support and sales teams, resolving top customer concerns and improving field readiness."
            ],
            "resume": true
        },
        {
            "name": "Computer Associates",
            "position": "Software Engineer",
            "url": "https://en.wikipedia.org/wiki/CA_Technologies",
            "startDate": "1999-12-01",
            "endDate": "2003-05-01",
            "highlights": [
                "Developed ARCserve features including SAN device sharing, tape drive encryption, and cluster failover handling.",
                "Maintained the SAN lab and supported the device certification team by configuring and validating new hardware.",
                "Implemented device support enhancements and resolved integration issues across the ARCserve ecosystem."
            ],
            "resume": false
        },
        {
            "name": "Computer Associates",
            "position": "Maintenance Software Engineer",
            "url": "https://en.wikipedia.org/wiki/CA_Technologies",
            "startDate": "1999-05-01",
            "endDate": "1999-12-01",
            "highlights": [
                "Diagnosed complex technical issues and collaborated with developers to produce patches and long-term fixes.",
                "Worked directly with customers to troubleshoot critical problems and ensure fast resolution.",
                "Published fixes and maintained documentation to prevent recurring issues."
            ],
            "resume": false
        },
        {
            "name": "Computer Associates / Cheyenne Software",
            "position": "Technical Support Representative",
            "url": "https://en.wikipedia.org/wiki/Arcserve",
            "startDate": "1996-02-01",
            "endDate": "1997-04-01",
            "highlights": [
                "Provided technical phone support for ARCserve across Windows NT and Novell NetWare environments.",
                "Escalated complex issues to Level 2 engineering when necessary to ensure fast and accurate resolution."
            ],
            "resume": false
        }
    ],
    "education": [
        {
            "institution": "Iona College",
            "url": "https://www.iona.edu/",
            "area": "Computer Science",
            "studyType": "Bachelor of Science",
            "location": "New Rochelle, NY",
            "startDate": "1989-09-01",
            "endDate": "1991-06-01"
        },
        {
            "institution": "St. John's University",
            "url": "https://www.stjohns.edu/",
            "area": "Computer Science",
            "studyType": "Bachelor of Science",
            "location": "New York, NY",
            "startDate": "1987-09-01",
            "endDate": "1989-06-01"
        }
    ],
    "projects": [
        {
            "name": "Project",
            "startDate": "2019-01-01",
            "endDate": "2021-01-01",
            "description": "Description...",
            "highlights": [
                "Won award at AIHacks 2016"
            ],
            "url": "https://project.com/"
        }
    ],
    "skills": [
        {
            "name": "Core Competencies",
            "level": "Advanced",
            "keywords": [
                "Agile Delivery",
                "Cross-Functional Collaboration",
                "Product Strategy",
                "Data Modeling",
                "Workflow Optimization",
                "Technical Communication"
            ]
        },
        {
            "name": "Project Management",
            "level": "Advanced",
            "keywords": [
                "Agile & Scrum Practices",
                "Backlog Management",
                "Release Planning",
                "Stakeholder Management",
                "Metrics & Reporting",
                "Continuous Improvement"
            ]
        },
        {
            "name": "Business Analysis",
            "level": "Proficient",
            "keywords": [
                "User Stories & Acceptance Criteria",
                "Functional Specifications",
                "Process Improvement",
                "UAT & QA Collaboration",
                "Data Analysis"
            ]
        },
        {
            "name": "Documentation & Communication",
            "level": "Proficient",
            "keywords": [
                "Wireframes & Diagrams",
                "Technical Writing",
                "Executive Communication"
            ]
        },
        {
            "name": "Technical Foundation",
            "level": "Proficient",
            "keywords": [
                "Programming Concepts",
                "Data Modeling",
                "Microservices Architecture",
                "Version Control"
            ]
        },
        {
            "name": "Tools & Platforms",
            "level": "Expert",
            "keywords": [
                "Jira & Confluence",
                "Google Analytics",
                "Figma & Lucidchart",
                "MS Office Suite"
            ]
        }
    ]
}